### Q1. List any five functions of the pandas library with execution.

In [7]:
import pandas as pd

In [8]:
data = {
    'Name':['Harry','Rahul','Mohan'],
    'Age' : [23, 24, 32],
    'Class': ['BCA', 'Mtech' ,'Btech'] 
    
}

In [12]:
df = pd.DataFrame(data)

In [17]:
df.head()

    Name  Age  Class
0  Harry   23    BCA
1  Rahul   24  Mtech
2  Mohan   32  Btech

In [18]:
df.tail()

    Name  Age  Class
0  Harry   23    BCA
1  Rahul   24  Mtech
2  Mohan   32  Btech

In [19]:
df.transpose()

           0      1      2
Name   Harry  Rahul  Mohan
Age       23     24     32
Class    BCA  Mtech  Btech

In [20]:
df.describe()

             Age
count   3.000000
mean   26.333333
std     4.932883
min    23.000000
25%    23.500000
50%    24.000000
75%    28.000000
max    32.000000

In [22]:
df.dtypes

Name     object
Age       int64
Class    object
dtype: object

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [49]:
df

    Name  Age  Class
0  Harry   23    BCA
1  Rahul   24  Mtech
2  Mohan   32  Btech

In [50]:
df2 = df.rename(columns= {'Name':'A','Age':'B','Class':'C'})

In [69]:
df2 = df2.set_index([list(range(0,6)[1::2])])

In [70]:
df2

       A   B      C
1  Harry  23    BCA
3  Rahul  24  Mtech
5  Mohan  32  Btech

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [71]:
df3 = df2

In [72]:
df3['Values'] = [10,23,21]

In [73]:
df3

       A   B      C  Values
1  Harry  23    BCA      10
3  Rahul  24  Mtech      23
5  Mohan  32  Btech      21

In [74]:
sum(df3['Values'])

54

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [75]:
 df4 = df3

In [76]:
df4

       A   B      C  Values
1  Harry  23    BCA      10
3  Rahul  24  Mtech      23
5  Mohan  32  Btech      21

In [78]:
df4['Text'] = ['Hello World','How are you','This is assignment']

In [79]:
df4

       A   B      C  Values                Text
1  Harry  23    BCA      10         Hello World
3  Rahul  24  Mtech      23         How are you
5  Mohan  32  Btech      21  This is assignment

In [84]:
df4['Word_Count'] = df4['Text'].apply(lambda x: len(str(x).split()))

In [85]:
df4

       A   B      C  Values                Text  Word_Count
1  Harry  23    BCA      10         Hello World           2
3  Rahul  24  Mtech      23         How are you           3
5  Mohan  32  Btech      21  This is assignment           3

### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [94]:
## DataFrame.size returns the total number of elements in the DataFrame.
## It is calculated as the product of the number of rows and columns in the DataFrame.
df4.size

18

In [103]:
## DataFrame.shape returns a tuple representing the dimensions of the DataFrame. 
## It provides the number of rows and columns in the DataFrame.
df4.shape

(3, 6)

###  Q6. Which function of pandas do we use to read an excel file?

####  Pandas.read_csv(.......)  use to read Csv file in pandas DataFrame

In [101]:
dff = pd.read_csv('https://raw.githubusercontent.com/Harpinder95/Assignments/main/train.csv')

In [102]:
dff

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

###  Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [104]:
df5 = df4

In [106]:
df5

       A   B      C  Values                Text  Word_Count
1  Harry  23    BCA      10         Hello World           2
3  Rahul  24  Mtech      23         How are you           3
5  Mohan  32  Btech      21  This is assignment           3

In [107]:
df5['Email'] = ['abc@gmail.com','username@domain.com','user@outlook.com']

In [112]:
df5

,A,B,C,Values,Text,Word_Count,Email
1,Harry,23,BCA,10,Hello World,2,abc@gmail.com
3,Rahul,24,Mtech,23,How are you,3,username@domain.com
5,Mohan,32,Btech,21,This is assignment,3,user@outlook.com

In [158]:
df5['Username'] = df5['Email'].str.split('@', expand=True)[0]

In [159]:
df5

,A,B,C,Values,Text,Word_Count,Email,Username
1,Harry,23,BCA,10,Hello World,2,abc@gmail.com,abc
3,Rahul,24,Mtech,23,How are you,3,username@domain.com,username
5,Mohan,32,Btech,21,This is assignment,3,user@outlook.com,user

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [160]:
data = {
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
}

In [163]:
df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [182]:
df.dtypes

A    int64
B    int64
C    int64
dtype: object

In [191]:
df[(df['A'] > 5) & (df['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

###  Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [204]:
data = {'Values': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]}

In [205]:
df = pd.DataFrame(data)

In [207]:
df

   Values
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10

In [216]:
type(df)

pandas.core.frame.DataFrame

In [220]:
def Calculate_data(df):
    mean = df.mean()
    median  = df.median()
    std = df.std()
    stat_df = pd.DataFrame({'Mean':mean,
           'Median':median,
           'Std Dev':std})
    return stat_df

In [223]:
print(Calculate_data(df))

        Mean  Median  Std Dev
Values   5.5     5.5  3.02765

###  Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [226]:
import pandas as pd

def calculate_moving_average(dataframe):
    # Ensure the DataFrame is sorted by the 'Date' column
    dataframe = dataframe.sort_values(by='Date')

    # Calculate the moving average for the 'Sales' column
    dataframe['MovingAverage'] = dataframe['Sales'].rolling(window=7, min_periods=1).mean()

    return dataframe

# Example usage:
data = {
    'Date': pd.date_range(start='2024-01-01', periods=10),
    'Sales': [10, 15, 20, 25, 30, 35, 40, 45, 50, 55]
}

df = pd.DataFrame(data)

# Call the function to calculate the moving average
df_with_moving_average = calculate_moving_average(df)

# Display the DataFrame with the moving average column
print(df_with_moving_average)

        Date  Sales  MovingAverage
0 2024-01-01     10           10.0
1 2024-01-02     15           12.5
2 2024-01-03     20           15.0
3 2024-01-04     25           17.5
4 2024-01-05     30           20.0
5 2024-01-06     35           22.5
6 2024-01-07     40           25.0
7 2024-01-08     45           30.0
8 2024-01-09     50           35.0
9 2024-01-10     55           40.0

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values: 
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [227]:
import pandas as pd

def add_weekday_column(df):
    # Ensure 'Date' is in datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Create a new column 'Weekday' containing the weekday names
    df['Weekday'] = df['Date'].dt.day_name()
    
    return df

# Example usage:
# Assuming df is your DataFrame with 'Date' column
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
df = pd.DataFrame(data)

# Call the function to add the 'Weekday' column
df_with_weekday = add_weekday_column(df)

# Display the modified DataFrame
print(df_with_weekday)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [228]:
import pandas as pd

def filter_by_date_range(df):
    # Ensure 'Date' is in datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Define the date range
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    
    # Create a boolean mask based on the date range
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    
    # Apply the mask to select rows within the date range
    selected_rows = df[mask]
    
    return selected_rows

# Example usage:
# Assuming df is your DataFrame with 'Date' column
data = {'Date': ['2023-01-01', '2023-01-15', '2023-01-25', '2023-02-05']}
df = pd.DataFrame(data)

# Call the function to filter rows by date range
selected_rows = filter_by_date_range(df)

# Display the selected rows
print(selected_rows)

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-25

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [229]:
import pandas as pd